Repository: microsoft/winget-cli
Catalog: Localization/Resources/*/winget.resw
Source language: en_gb
Languages: af_za, am_et, ar_sa, az_latn_az, bg_bg, cs_cz, da_dk, de_de, el_gr, es_es, es_mx, et_ee, fa_ir, fi_fi, fr_fr, gl_es, he_il, hi_in, hu_hu, id_id, is_is, it_it, ja_jp, kk_kz, lo_la, lt_lt, lv_lv, mk_mk, ml_in, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sq_al, sr_latn_rs, sv_se, te_in, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# CountArgumentDescription
source: Show no more than specified number of results
af_za: Wys niks meer as die gespesifiseerde aantal resultate nie
am_et: ከተገለጸው ብዛት በላይ የሆኑ ውጤቶችን አታሳይ
ar_sa: لا تعرض أكثر من العدد المحدد من النتائج
az_latn_az: Qeyd edilən saydan artıq nəticə göstərilməsin
bg_bg: Показване на не повече от зададения брой резултати
cs_cz: Nezobrazovat víc než zadaný počet výsledků
da_dk: Vis ikke mere end det angivne antal resultater
de_de: Nicht mehr als festgelegte Anzahl von Ergebnissen anzeigen
el_gr: Εμφανίζει μόνο τον συγκεκριμένο αριθμό αποτελεσμάτων
es_es: No mostrar más que el número especificado de resultados
es_mx: No mostrar más que la cantidad de resultados especificada.
et_ee: Kuvatakse ainult määratud arv tulemeid, mitte rohkem
fa_ir: تعداد بیشتری از نتایج مشخص‌شده را نمایش نمی‌دهد
fi_fi: Näytä vain määritetty määrä tuloksia
fr_fr: Ne pas afficher plus de résultats que le nombre spécifié
gl_es: Non mostrar máis resultados cós que se especifican
he_il: אל תציג יותר ממספר התוצאות שצוין
hi_in: परिणाम की निर्दिष्ट संख्या से अधिक न दिखाएँ
hu_hu: Csak a megadott számú vagy kevesebb eredmény megjelenítése
id_id: Tampilkan tidak lebih dari jumlah hasil yang ditentukan
is_is: Sýna ekki fleiri en tiltekinn fjölda niðurstaðna
it_it: Non mostrare più del numero specificato di risultati
ja_jp: 指定した数以下の結果を表示
kk_kz: Нәтижелердің көрсетілген санынан көп көрсетпеу
lo_la: ສະແດງບໍ່ເກີນຈຳນວນຜົນການຊອກຫາທີ່ລະບຸ
lt_lt: Rodyti ne daugiau nei nurodytą rezultatų skaičių
lv_lv: Rādīt ne vairāk par norādīto rezultātu skaitu
mk_mk: Прикажете не повеќе од наведениот број на резултати
ml_in: നിർദ്ദിഷ്ട ഫലങ്ങളുടെ എണ്ണത്തിൽ കൂടുതൽ കാണിക്കരുത്
ms_my: Tunjukkan tidak lebih daripada bilangan hasil yang ditentukan
nb_no: Ikke vis mer enn angitt antall resultater
nl_nl: Niet meer dan het opgegeven aantal resultaten weergeven
pl_pl: Wyświetlaj maksymalnie określoną liczbę wyników
pt_br: Mostrar não mais do que o número especificado de resultados
pt_pt: Mostrar, no máximo, o número de resultados especificado
ro_ro: Nu se afișează mai mult decât numărul specificat de rezultate
ru_ru: Отображать не более указанного количества результатов
sk_sk: Nezobrazovať viac ako zadaný počet výsledkov
sl_si: Prikaz več kot določenega števila rezultatov
sq_al: Mos shfaq më shumë sesa numri i specifikuar i rezultateve
sr_latn_rs: Ne prikazuj više od navedenog broja rezultata
sv_se: Visa högst angivet antal resultat
te_in: పేర్కొన్న ఫలితాల సంఖ్య కంటే ఎక్కువ చూపించవద్దు
th_th: แสดงผลไม่เกินจำนวนผลลัพธ์ที่ระบุ
tr_tr: Belirtilen sayıdan fazla sonuç gösterme
uk_ua: Відображення не більше вказаної кількості результатів
vi_vn: Hiển thị không vượt quá số kết quả đã xác định
zh_cn: 显示不超过指定数量的结果
zh_tw: 顯示不超過指定數量的結果

# ExactArgumentDescription
source: Find app using exact match
af_za: Vind toepassing deur presiese pasmaat te gebruik
am_et: ቃል በቃል ተዛምዶን በመጠቀም መተግበሪያዎችን ያግኙ
ar_sa: البحث عن الحزمة باستخدام التطابق التام
az_latn_az: Dəqiq uyğunluqdan istifadə etməklə proqramı tapın
bg_bg: Намиране на приложение с точно съвпадение
cs_cz: Najít aplikace podle přesné shody
da_dk: Find appen med nøjagtigt match
de_de: App mit exakter Übereinstimmung suchen
el_gr: Εύρεση εφαρμογής με τη χρήση ταιριάσματος ακριβείας
es_es: Buscar aplicación con coincidencia exacta
es_mx: Buscar aplicación con la coincidencia exacta.
et_ee: Saate rakenduse otsimiseks kasutada täpset vastet
fa_ir: یافتن بسته با استفاده از مطابقت دقیق
fi_fi: Etsi sovellus käyttämällä tarkkaa vastaavuutta
fr_fr: Rechercher une application à l’aide d’une correspondance exacte
gl_es: Atopar paquete usando coincidencias exactas
he_il: איתור יישום באמצעות התאמה מדויקת
hi_in: सटीक मिलान का उपयोग कर ऐप ढूँढें
hu_hu: Alkalmazás keresése pontos egyezés használatával
id_id: Temukan aplikasi menggunakan pencocokan yang sama persis
is_is: Finna forrit með því að nota nákvæma samsvörun
it_it: Trova pacchetto con corrispondenza esatta
ja_jp: 完全一致を使用してアプリを検索
kk_kz: Дәл сәйкестік арқылы бағдарламаны табу
lo_la: ຊອກຫາແອັບໂດຍໃຊ້ຂໍ້ມູນທີ່ກົງກັນແນ່ນອນ
lt_lt: Rasti programą naudojant tikslų atitikmenį
lv_lv: Atrast programmu, izmantojot precīzu atbilstību
mk_mk: Најдете ја апликацијата со целосно совпаѓање
ml_in: കൃത്യമായ പൊരുത്തം ഉപയോഗിച്ച് അപ്ലിക്കേഷൻ കണ്ടെത്തുക
ms_my: Cari aplikasi menggunakan padanan tepat
nb_no: Finn app med nøyaktig samsvar
nl_nl: App vinden op basis van een exacte overeenkomst
pl_pl: Znajdź pakiet przy użyciu dokładnego dopasowania
pt_br: Localizar o aplicativo usando uma correspondência exata
pt_pt: Localizar aplicação com correspondência exata
ro_ro: Găsiți aplicația utilizând potrivire exactă
ru_ru: Поиск приложения с использованием точного соответствия
sk_sk: Nájsť aplikáciu pomocou presnej zhody
sl_si: Iskanje programa z uporabo natančnega ujemanja
sq_al: Gjej paketa duke përdorur përputhje të saktë
sr_latn_rs: Pronalaženje aplikacije pomoću potpunog podudaranja
sv_se: Hitta appen med exakt matchning
te_in: ఖచ్చితమైన సరిపోలికను ఉపయోగించి అనువర్తనాన్ని కనుగొనండి
th_th: ค้นหาแอปโดยใช้รายการที่ตรงกันทุกประการ
tr_tr: Uygulamayı tam eşleşme kullanarak bulma
uk_ua: Знайти програму за допомогою точної відповідності
vi_vn: Tìm ứng dụng theo kết quả khớp hoàn toàn
zh_cn: 使用精确匹配查找应用
zh_tw: 以完全相符，來尋找套件

# ExtraPositionalError
source: Found a positional argument when none was expected
af_za: ’n Posisionele argument is gevind terwyl niks verwag is nie
am_et: ማንም በማይጠበቅበት ጊዜ የቦታ ክርክር አገኘ
ar_sa: تم العثور على وسيطة موضعية عند عدم توقع أي منها
az_latn_az: Heç biri gözlənilmədiyi halda bir mövqeli arqument tapıldı
bg_bg: Намерени са позиционни аргументи, когато не се очакваше
cs_cz: Našel se poziční argument, i když nebyl očekáván.
da_dk: Der blev fundet et positionsargument, da intet var forventet
de_de: Ein positionelles Argument wurde gefunden, obwohl keines erwartet wurde
el_gr: Βρέθηκε ένα όρισμα θέσης, ενώ δεν αναμενόταν
es_es: Se encontró un argumento posicional cuando no se esperaba nada
es_mx: Se encontró un argumento de puesto inesperado.
et_ee: Leiti paigutusega argument, mida ei oodatud
fa_ir: آرگومان موضعی یافت شد، وقتی هیچ کدام مورد انتظار نبود
fi_fi: Löydettiin positioargumentti, kun yhtäkään ei odotettu
fr_fr: Un argument positionnel a été trouvé lorsque aucune valeur n’était attendue
gl_es: Atopouse un argumento de posición malia que non se esperaba atopar ningún
he_il: נמצא ארגומנט מיקום כאשר לא היה צפוי ארגומנט מסוג זה
hi_in: अपेक्षित न होने पर भी स्थितिपूर्ण तर्क मिला
hu_hu: Pozícióhoz kötött argumentum található, pedig a parancs nem várt ilyet
id_id: Menemukan argumen posisi ketika tidak ada yang diharapkan
is_is: Fann stöðufrumbreytu þegar engin var væntanleg
it_it: È stato trovato un argomento posizionale nonostante non ne fosse previsto alcuno
ja_jp: 必要なものが見つからないときに位置指定引数が見つかりました
kk_kz: Ешқандай аргумент күтілмеген кезде, бір позициялық аргумент табылды
lo_la: ພົບອາກິວເມັນລະບຸຕຳແໜ່ງໂດຍບໍ່ຄາດຄິດ
lt_lt: Rastas pozicinis argumentas, kai nesitikėta
lv_lv: Atrasts pozicionāls arguments, bet tāds nebija paredzēts
mk_mk: Најдовме аргумент за положба кога не го очекувавме
ml_in: ഒന്നും പ്രതീക്ഷിക്കാത്തപ്പോൾ ഒരു സ്ഥാന വാദം കണ്ടെത്തി
ms_my: menjumpai argumen apabila tiada yang dijangkakan
nb_no: Fant et plasseringsargument når det ikke var forventet
nl_nl: Er is een positioneel argument gevonden, terwijl er geen werd verwacht
pl_pl: Znaleziono nieoczekiwany argument pozycyjny
pt_br: Localizado um argumento posicional quando nenhum era esperado
pt_pt: Foi encontrado um argumento posicional, mas não era esperado nenhum
ro_ro: Am găsit un argument pozițional atunci când nu era niciunul așteptat
ru_ru: Нашел позиционный аргумент, когда никто не ожидал
sk_sk: Našiel sa pozičný argument, keď sa neočakával žiaden
sl_si: Najden je bil položajen argument, ko se ga ni pričakovalo
sq_al: U gjet një argument pozicional kur nuk pritej asnjë
sr_latn_rs: Pronađen je pozicioni argument kada nije bio očekivan nijedan
sv_se: Hittade ett positionsargument när inget förväntades
te_in: ఏదీ ఊహించనప్పుడు స్థాన వాదన కనుగొనబడింది
th_th: พบอาร์กิวเมนต์ตามตำแหน่งเมื่อไม่มีอาร์กิวเมนต์ที่คาดการณ์
tr_tr: Beklenmediği halde bir konumsal bağımsız değişken bulundu
uk_ua: Знайдено неочікуваний аргумент позиції
vi_vn: Đã tìm thấy một đối số vị trí khi không dự kiến
zh_cn: 在未预期的情况下找到位置参数
zh_tw: 在未預期的情況下找到位置引數

# FileArgumentDescription
source: File to be hashed
af_za: Lêer wat gemerk moet word
am_et: ሃሽ የሚደረግ ፋይል
ar_sa: الملف المطلوب تجزئته
az_latn_az: Heşlənməli fayl
bg_bg: Файл за хеширане
cs_cz: Soubor připravený na hash
da_dk: Fil til hashing
de_de: Zu hashende Datei
el_gr: Αρχείο προς κατακερματισμό
es_es: Archivo al que se va a aplicar un algoritmo hash
es_mx: Archivo a sintetizar.
et_ee: Räsitav fail
fa_ir: فایلی است که باید درهم‌سازی شود
fi_fi: Hajautettava tiedosto
fr_fr: Fichier à hacher
gl_es: Ficheiro ao que se lle aplicará o hash
he_il: הקובץ שברצונך לבצע בו Hash
hi_in: फ़ाइल जिसे हैश करना है
hu_hu: A kivonatolandó fájl
id_id: File yang akan di-hash
is_is: Skrá sem tætt verður
it_it: File su cui eseguire l'hashing
ja_jp: ハッシュするファイル
kk_kz: Хэштелетін файл
lo_la: ໄຟລ໌ເພື່ອແຮຊ
lt_lt: Failas, kuriam reikia maišos
lv_lv: Jaucamais fails
mk_mk: Датотека за хаширање
ml_in: ഹാഷ് ചെയ്യേണ്ട ഫയൽ
ms_my: Fail untuk dicincang
nb_no: Fil som skal hash-kodes
nl_nl: Bestand dat moet worden gehasht
pl_pl: Plik, dla którego zostanie utworzony skrót
pt_br: Arquivo em que será gerado o hash
pt_pt: Ficheiro para efetuar o hash
ro_ro: Fișier de asimilat
ru_ru: Файл для хэширования
sk_sk: Súbor na určenie hodnoty hash
sl_si: Datoteka, ki jo želite razpršiti
sq_al: Skedari që do të lokalizohet
sr_latn_rs: Datoteka koju treba heširati
sv_se: Fil som ska hashas
te_in: హాష్ చేయవలసిన ఫైల్
th_th: ไฟล์ที่จะแฮช
tr_tr: Karma oluşturulacak dosya
uk_ua: Файл для гешування
vi_vn: Tệp cần băm
zh_cn: 进行哈希处理的文件
zh_tw: 雜湊的檔案

# FlagContainAdjoinedError
source: Flag argument cannot contain adjoined value
af_za: Vlagargument kan nie aangrensende waarde bevat nie
am_et: ጠቋሚ ነጋሪ እሴት ተጓዳኝ እሴት ሊይዝ አይችልም
ar_sa: لا يمكن أن تحتوي وسيطة العلامة على قيمة مجاورة
az_latn_az: Bayraq arqumenti bitişik dəyər ehtiva edə bilməz
bg_bg: Аргументът на флага не може да съдържа прилежаща стойност
cs_cz: Argument příznaku nemůže obsahovat sousedící hodnotu.
da_dk: Flag-argumentet kan ikke indeholde en tilstødende værdi
de_de: Kennzeichen-Argument darf keinen angrenzenden Wert enthalten
el_gr: Το όρισμα σημαία δεν μπορεί να περιέχει γειτνιάζουσα τιμή
es_es: El argumento de marca no puede contener un valor contiguo
es_mx: El argumento de marca no puede contener un valor adjunto.
et_ee: Lipuargument ei tohi sisaldada külgnevat väärtust
fa_ir: آرگومان نشانه‌نما نمی‌تواند حاوی مقدار الحاقی باشد
fi_fi: Merkintäargumentti ei voi sisältää liitettyä arvoa
fr_fr: L’argument indicateur ne peut pas contenir de valeur contigüe
gl_es: O argumento de marcador non pode conter un valor anexo
he_il: ארגומנט דגל אינו יכול להכיל ערך צמוד
hi_in: ध्वज तर्क में सम्‍मिलित मान नहीं हो सकता
hu_hu: A jelölő argumentum nem tartalmazhat szomszédos értéket
id_id: Argumen bendera tidak dapat berisi nilai bergabungan
is_is: Flagg frumbreytu getur ekki innihaldið samliggjandi gildi
it_it: L'argomento del contrassegno non può contenere un valore adiacente
ja_jp: フラグ引数に隣接値を含めることはできません
kk_kz: Жалауша аргументінде қосылған мән болмауы тиіс
lo_la: ອາກິວເມັນທຸງບໍ່ສາມາດມີຄ່າທີ່ເຊື່ອມກັນໄວ້ໄດ້
lt_lt: Argumento žymė negali turėti prijungtos reikšmės
lv_lv: Karodziņa argumentam nevar pievienotas vērtības
mk_mk: Аргументот во форма на знаменце не може да содржи споена вредност
ml_in: ഫ്ലാഗ് ആർഗ്യുമെന്റിൽ ആഡ്ജോയിൻഡ് മൂല്യം ഉൾപെടുത്താൻ കഴിയില്ല
ms_my: Argumen menandakan tidak boleh mengandungi nilai adjoined
nb_no: Flaggargumentet kan ikke inneholde tilstøtende verdi
nl_nl: Vlagargument mag geen verbonden waarde bevatten
pl_pl: Argument flagi nie może zawierać połączonej wartości
pt_br: Argumento sinalizado não pode conter valores adjacentes
pt_pt: O argumento de sinalizador não pode conter um valor adjacente
ro_ro: Argumentul de semnalizare nu poate conține valoare alăturată
ru_ru: Аргумент флага не может содержать присоединенное значение
sk_sk: Argument príznaku nesmie obsahovať vedľajšiu hodnotu
sl_si: Argument zastavice ne sme vsebovati sosednje vrednosti
sq_al: Argumenti i flamurit nuk mund të përmbajë vlerë të ngjitur
sr_latn_rs: Argument zastavice ne može da sadrži povezanu vrednost
sv_se: Flaggargumentet kan inte innehålla ett angränsande värde
te_in: జెండా వాదన ప్రక్కనే ఉన్న విలువను కలిగి ఉండకూడదు
th_th: อาร์กิวเมนต์ที่ตั้งค่าสถานะไม่สามารถมีค่าที่ติดกันได้
tr_tr: Bayrak bağımsız değişkeni ekli değeri içeremez
uk_ua: Аргумент позначки не може містити приєднане значення
vi_vn: Đối số gắn cờ không thể chứa giá trị liên kết
zh_cn: 标记参数不得含有邻近值
zh_tw: 旗標引數不能包含鄰近值

# ForceArgumentDescription
source: Execute the command without prompts
af_za: Voer die bevel sonder porre uit
am_et: ትዕዛዙን ያለ መጠይቅ ፈጽም
az_latn_az: Əmri dəvət olmadan yerinə yetirin
bg_bg: Изпълнение на командата без подкани
cs_cz: Provést příkaz bez vyzvání
da_dk: Udfør kommandoen uden prompter
de_de: Befehl ohne Eingabeaufforderungen ausführen
el_gr: Εκτέλεση εντολής χωρίς μηνύματα
es_es: Ejecutar el comando sin preguntar
es_mx: Ejecutar el comando sin aviso.
et_ee: Käsk käivitatakse ilma viipadeta
fi_fi: Suorita komento ilman kehotteita
fr_fr: Exécuter la commande sans invite
he_il: ביצוע הפקודה ללא הנחיות
hi_in: बिना संकेतों के आदेश निष्पादित करें
hu_hu: A parancs végrehajtása felszólítások nélkül
id_id: Jalankan perintah tanpa wantian
is_is: Framkvæma skipunina án kvaðninga
ja_jp: ダイアログを表示せずコマンドを実行
kk_kz: Пәрменді нұсқауларсыз орындау
lo_la: ນຳໃຊ້ຄຳສັັ່ງໂດຍບໍ່ຕ້ອງແຈ້ງບອກ
lt_lt: Vykdyti komandą be įspėjimų
lv_lv: Izpildīt komandu bez uzvednēm
mk_mk: Извршете ја наредбата без потсетници
ml_in: പ്രോംപ്റ്റ് കൂടാതെ കമാൻഡ് നടപ്പിലാക്കുക
ms_my: Melaksanakan perintah tanpa prom
nb_no: Utfør kommandoen uten spørsmål
nl_nl: De opdracht uitvoeren zonder vragen om invoer
pt_br: Executar o comando sem avisos
pt_pt: Executar o comando sem pedidos
ro_ro: Executare comandă fără solicitări
ru_ru: Выполнить команду без запросов
sk_sk: Spustiť príkaz bez výziev
sl_si: Izvršitev ukaza brez poziva
sr_latn_rs: Izvršavanje komande bez odziva
sv_se: Kör kommandot utan uppmaningar
te_in: ప్రాంప్ట్ లేకుండా ఆదేశాన్ని అమలు చేయండి
th_th: ดำเนินการคำสั่งโดยไม่มีพร้อมท์
tr_tr: Komutu istemsiz çalıştırma
uk_ua: Виконати команду без підказок
vi_vn: Thực thi lệnh mà không cần lời nhắc
zh_cn: 执行命令而不提示

# HashCommandLongDescription
source: Computes the hash of a local file, appropriate for entry into a manifest. It can also compute the hash of the signature file of an MSIX package to enable streaming installations.
af_za: Bepaal die huts van ’n lokale lêer, geskik vir invoer in ’n manifes in. Dit bepaal ook die huts van die handtekeninglêer van ’n MSIX-pakket om strominginstallasies te aktiveer.
am_et: ወደ ማኒፌስቱ ለማስገባት ተገቢ በሆነ መልኩ የሎካል ፋይሉን ሃሽ ያሰላል። ከሌላ ቦታ ሆኖ መጫን እንዲቻል የ MSIX ጥቅል ሲግኔቸር ፋይል ሃሽ ማስላትም ይችላል።
ar_sa: يقوم بحساب تجزئة الملف المحلي، المناسب للإدخال في بيان التطبيق. يمكنه أيضاً حساب تجزئة ملف التوقيع لحزمة MSIX لتمكين تثبيتات دفق البيانات.
az_latn_az: Lokal faylın manifestə girişi üçün müvafiq heşini hesablayır. Həmçinin quraşdırmaları ötürməyi aktivləşdirmək üçün MSIX paketinin imza faylının heşini hesablaya bilər.
bg_bg: Изчислява хеш на локален файл, подходящ за влизане в манифест. Може също така да изчисли хеш на файла с подписа на MSIX пакет, за да разреши поточното инсталиране на поток.
cs_cz: Vypočítá hodnotu hash místního souboru vhodnou pro zadání do manifestu. Může také vypočítat hodnotu hash souboru s podpisem balíčku MSIX, aby bylo možné provádět streamingové instalace.
de_de: Berechnet den Hash einer lokalen Datei, die für den Eintrag in ein Manifest geeignet ist. Es kann auch der Hash der Signaturdatei eines MSIX-Pakets berechnet werden, um Streaming-Installationen zu ermöglichen.
el_gr: Υπολογίζει τον κωδικό κατακερματισμό ενός τοπικού αρχείου, ο οποίος κατάλληλος για εισαγωγή σε μια διακήρυξη. Μπορεί επίσης να υπολογίσει τον κατακερματισμό του αρχείου υπογραφής ενός πακέτου MSIX για την ενεργοποίηση εγκαταστάσεων ροής.
es_es: Calcula el hash de un archivo local, apropiado para la entrada en un manifiesto. También puede calcular el hash del archivo de firma de un paquete MSIX para habilitar las instalaciones de transmisión por secuencias.
es_mx: Calcula el hash de un archivo local, apropiado para la entrada en un manifiesto de aplicación. También puede calcular el hash del archivo de firma de un paquete de MSIX para habilitar las instalaciones de streaming.
et_ee: Arvutab kohaliku faili räsi, mis sobib manifesti sisestamiseks. Samuti oskab see arvutada MSIX-paketi signatuurifaili räsi vooginstallide lubamiseks.
fa_ir: هش یک فایل محلی را که برای ورود به یک مانیفست مناسب است محاسبه می‌کند. با این کار همچنین می‌توان هش فایل امضای یک بسته MSIX را برای فعالسازی نصب‌های جریان محاسبه کرد.
fi_fi: Laskee paikallisen tiedoston hajautusarvon, soveltuu luettelotiedoston kohteisiin. Voi myös laskea MSIX-paketin allekirjoitustiedoston hajautuksen, jotta virtauttamisen asennukset voidaan ottaa käyttöön.
fr_fr: Calcule le hachage d’un fichier local, approprié pour l’entrée dans un manifeste. Il peut également calculer le hachage du fichier de signature d’un paquet MSIX afin d’activer les installations en continu.
gl_es: Calcula o hash dun ficheiro local, adecuado para a entrada nun manifesto. Tamén se pode calcular o hash do ficheiro de sinatura dun paquete MSIX para activar as instalacións de transmisión en secuencia.
he_il: מחשב את קוד ה- Hash של קובץ מקומי, המתאים להזנה למניפסט. הוא מסוגל גם לחשב את קוד ה- Hash של קובץ החתימה של חבילת MSIX כדי לאפשר התקנות באמצעות זרימה.
hi_in: किसी मैनिफ़ेस्ट में प्रविष्टि के लिए उपयुक्त स्थानीय फ़ाइल के हैश की गणना करता है. यह स्ट्रीमिंग स्थापनाओं को सक्षम करने के लिए किसी MSIX पैकेज की हस्ताक्षर फ़ाइल के हैश की भी गणना कर सकता है.
hu_hu: Kiszámítja egy helyi fájl kivonatát, amely utána felvehető egy jegyzékfájlba. Egy MSIX-csomag aláírásfájljának kivonatát is ki tudja számítani adatfolyamos telepítések lehetővé tételéhez.
is_is: Reiknar tætigildi staðbundinnar skrár, sem er viðeigandi til að færa í skrá. Það getur einnig reiknað út tætigildi undirritunarskráar með MSIX-pakka til að virkja uppsetningar straumspilunar.
it_it: Calcola l'hash di un file locale, appropriato per l'ingresso in un manifesto. Può anche calcolare l'hash del file della firma di un pacchetto MSIX per abilitare le installazioni di streaming multimediale.
ja_jp: マニフェストへのエントリに適したローカル ファイルのハッシュを計算します。また、MSIX パッケージの署名ファイルのハッシュを計算して、ストリーミング インストールを有効にすることもできます。
kk_kz: Манифестке жазуға жарамды жергілікті файл хэшін есептейді. Сондай-ақ ағындық орнату жұмыстарына рұқсат ету үшін, MSIX бумасына арналған қолтаңба файлының хэшін есептей алады.
lo_la: ຄຳນວນແຮຊຂອງໄຟລ໌ໃນເຄື່ອງ, ກ່ຽວຂ້ອງກັບການປ້ອນເຂົ້າໃສ່ manifest ໃດໜຶ່ງ. ນອກຈາກນັ້ນ, ມັນຍັງສາມາດຊ່ວຍຄຳນວນແຮຊຂອງໄຟລ໌ລາຍເຊັນແພັກເກດ MSIX ໃດໜຶ່ງເພື່ອເປີດການນຳໃຊ້ການຕິດຕັ້ງການສະຕຣີມໄດ້.
lt_lt: Apskaičiuoja vietinio failo, tinkančio deklaracijos įrašui, maišą. Ji taip pat gali apskaičiuoti MSIX paketo parašo failo maišą, kad būtų galima įgalinti srautinio perdavimo diegimus.
lv_lv: Aprēķina lokālā faila jaucējkodu, kas piemērots ievadei manifestā. Var arī aprēķināt MSIX pakotnes paraksta faila jaucējkodu, lai iespējotu straumēšanas instalēšanu.
ms_my: Mengira cincangan fail tempatan, sesuai untuk dimasukkan ke dalam manifes. Ia juga boleh mengira cincangan fail tandatangan bagi pakej MSIX untuk mendayakan pemasangan penstriman.
nb_no: Beregner hash-koden for en lokal fil, som passer for oppføring i et manifest. Den kan også beregne hash-koden til signaturfilen til en MSIX-pakke for å aktivere strømmeinstallasjoner.
nl_nl: Berekent de hash van een lokaal bestand, geschikt voor invoer in een manifest. Het kan ook de hash van het handtekeningbestand van een MSIX-pakket berekenen om streaminginstallaties mogelijk te maken.
pl_pl: Oblicza wartość skrótu lokalnego pliku, która jest odpowiednia dla wpisu do manifestu. Może też obliczyć wartość skrótu pliku podpisu pakietu MSIX, aby włączyć instalacje strumieniowe.
pt_br: Calcula o hash de um arquivo local, apropriado para entrada em um manifesto. Ele também pode calcular o hash do arquivo de assinatura de um pacote MSIX para habilitar instalações de streaming.
pt_pt: Calcula o código hash de um ficheiro local, adequado para entrada num manifesto. Também pode calcular o hash do ficheiro de assinatura de um pacote MSIX para possibilitar instalações de transmissão em fluxo.
ro_ro: Calculează codul hash al unui fișier local, potrivit ca intrare într-un manifest. De asemenea, poate calcula codul hash al fișierului de semnătură al unui pachet MSIX, pentru a activa instalările în flux.
sk_sk: Vypočíta hodnotu hash lokálneho súboru, ktorá je vhodná pre zapísanie do manifestu. Môže tiež vypočítať hodnotu hash súboru s podpisom balíka MSIX na umožnenie inštalácií so streamovaním.
sl_si: Izračuna zgoščeno vrednost lokalne datoteke, primerno za vnos v manifest. Prav tako lahko izračuna zgoščeno vrednost datoteke podpisa v paketu MSIX in tako omogoči pretočne namestitve.
sq_al: Llogarit hashtin e një skedari lokal, të përshtatshme për hyrjen në një manifest. Mund të llogarisë gjithashtu hash-un e skedarit të nënshkrimit të një pakete MSIX për të mundësuar instalimet e transmetimit.
sr_latn_rs: Izračunava heš lokalne datoteke koji je prikladan za unos u manifest. Takođe može da računa i heš datoteke potpisa MSIX paketa da bi se omogućile instalacije protoka.
sv_se: Beräknar hash för en lokal fil som passar för inmatning i ett manifest. Kan också beräkna hash för signeringsfilen i ett MSIX-paket för att aktivera streaminginstallationer.
te_in: మానిఫెస్ట్‌లోకి ప్రవేశించడానికి తగిన స్థానిక ఫైల్ యొక్క హాష్‌ను లెక్కిస్తుంది. ఇది స్ట్రీమింగ్ వ్యవస్థాపనలను ప్రారంభించడానికి MSIX ప్యాకేజీ యొక్క సంతకం ఫైల్ యొక్క హాష్‌ను కూడా లెక్కించవచ్చు.
th_th: คำนวณแฮชของไฟล์ในเครื่อง ซึ่งเหมาะสำหรับรายการในไฟล์กำกับ นอกจากนี้ยังสามารถคำนวณแฮชของไฟล์ลายเซ็นของแพคเกจ MSIX เพื่อเปิดใช้งานการติดตั้งการสตรีมได้อีกด้วย
tr_tr: Bir yerel dosyanın karma değerini, bildirim girişine uygun olarak hesaplar. Akış yüklemelerinin etkinleştirilmesi için bir MSIX paketine ilişkin imza dosyasının karmasını da hesaplar.
uk_ua: Обчислює відповідний для запису в маніфест геш локального файлу. Також обчислює геш файлу підпису для MSIX пакета, щоб дозволити потокові інсталяції.
vi_vn: Tính toán hàm băm của một tệp cục bộ, thích hợp để nhập vào một tệp kê khai. Ứng dụng này cũng có thể tính toán hàm băm từ tệp chữ ký của gói MSIX để cho phép cài đặt phát trực tuyến.
zh_cn: 计算本地文件的哈希值，适用于清单中的条目。此外，它还可以计算 MSIX 程序包的签名文件的哈希，以启用流式安装。
zh_tw: 計算適合在資訊清單輸入的本機檔案雜湊。它也可以計算 MSIX 封裝的簽章檔案雜湊，以啟用串流安裝。
